CSI API ETABS v1
cPropFrame.SetMaterial Method
 Sets the material property of a defined frame section
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetMaterial(
	string Name,
	string MatProp
)
Function SetMaterial (
	Name As String,
	MatProp As String
) As Integer
Dim instance As cPropFrame
Dim Name As String
Dim MatProp As String
Dim returnValue As Integer
returnValue = instance.SetMaterial(Name,
	MatProp)
int SetMaterial(
	String^ Name,
	String^ MatProp
)
abstract SetMaterial :
        Name : string *
        MatProp : string -> int
Parameters
Name
Type: System.String
 The name of an existing frame section property.
MatProp
Type: System.String
 The name of the material property for the section.
Return Value
Type: Int32
 Returns zero if the material property is successfully set; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim FileName As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'set new frame section property
       ret = SapModel.PropFrame.SetTee("TEE1", "A992Fy50", 12, 10, 0.6, 0.3)
   'set frame section material property data
       ret = SapModel.PropFrame.SetMaterial("TEE1", "A992Fy50")
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropFrame Interface
ETABSv1 Namespace